<?php

function lang($str){

	$langua = array(
	'hoverinfo' => '<p>В указанную стоимость входит:<br>
- Подготовка Архитектурного раздела<br>
     и Согласование с мерией<br>
- Подготовка Конструктивного раздела<br>
* топографическая карта - по договору<br>
* заключение геолога - по договору</p>',
'hoverinfo2' => '<p>Ориентировочная стоимость строительства<br>
«белый каркас»<br>
- отделка фасадов здания<br>
- Возведение перегородок,<br>
   оштукатуривание стен, стяжка пола<br>
- разводка труб горячей и холодной воды,<br>
      отопительной системы<br>
- укладка электро проводки<br>
* Стоимость является примерной<br>
 и не учитывает всех конструктивных<br>
 особенностей дома, условий конкретного<br>
 земельного участка и индивидуальных<br>
пожеланий к строительным материалам.</p>',
	'select' => 'выберите',
	'da' => 'Скачать Вложения',
	'getintouch' => ' Cвяжитесь с нами! ',
    'sitetitle' => ' proeqti.ge ',
    'mobile'  => 'Mобильный',
     'call'  => 'Звоните нам: ',
    'January'  => 'январь',
	'February'  => 'февраль',
	'views'  => 'Просмотров',
	'March'  => 'Март',
	'April'  => 'апрель',
    'May'  => 'май',
	'June'  => 'июнь',
    'July'  => 'июль',
	'August'  => 'август',
	'September' => 'сентябрь',
	'October'  => 'октября',
	'November'  => 'ноябрь',
	'December'  => 'декабрь',
    'manage_content' => 'Управление контентом',
    'manage_cat' => 'Категорийный менеджмент',
    'manage_users' => 'управление пользователями',
    'user' => 'пользователь',
    'username' => 'пользователь',
    'password' => 'пароль',
	'password2' => 'Подтверждение пароля',
	'captcha2' => 'Запишите номера здесь',	
    'email' => 'Эл. почта',
	'enter' => 'войти',
	'mypage'  => 'Моя страница',
    'clear' => 'отмена',
    'yourname' => 'Введите свое имя',
    'adminpanel' => 'Панель управления',
    'welcome' => 'добро пожаловать',
    'portfolio' => 'портфель',
	'booking' => 'бронирование',
	'price' => 'цена',
    'create_user' => 'Регистрация',
    'signup' => 'Регистрация / Войти',
    'register' => 'Регистрация',
	'successregister' => 'Вы успешно подписались',
	'sameuser'	=> 'Это имя пользователя уже существует в базе данных!',
	'passwordnotmuch'	=> 'Пароли не совпадают!',
	'antispamnot'	=> 'Регистрация неправильно!',
	'allfieldsrequide'	=> 'Все поля обязательные для заполнения!',
	'youenternotright'	=> 'Вы неправильно ввели или имя пользователя или пароль!',	
    'log_in_user' => 'авторизация',
	'login' => 'авторизация',
    'logout' => 'выход',
    'search' => 'поиск',
    'readmore' => 'подробнее',
    'videos' => 'Видео',
    'home' => 'Главная',
    'index' => 'Главная',
    'news' => 'новости',
    'services' => 'услуги',
    'all_services' => 'Все сервисы',
	'products' => 'продукты',
    'contact' => 'контакт',
	'contactinfo' => 'Контактная информация',	
	'reset' => 'Сбросить',
	'send' => 'Отправить',
	
    'contacts' => 'контакт',
    'quikcontact' => 'контакт',
    'trainnings' => 'Тренинги',
    'duration' => 'длительность',
	'day' => 'День',
	'order' => 'Форма заказа',
	'right_email' => 'Введите правильный EMAIL',
        #შეტყობინებები   
    'logged_in_failed' => 'Вход не может . Попробуйте сначала.',
	'valid_email' => 'Введите адрес электронной почты.',
	'username_already_in_use' => 'Занят имя пользователя.',
    'cant_be_blank'  => ' не могут быть пустыми. ',   
    'address'  => 'адрес',  
    'phone' => 'телефон',
    'social'  => 'социальная сеть',  
    'contactform'  => 'Контактная форма',  
    'submitbutton'  => 'Отправить',  
    'yourmassage'  => 'Ваше сообщение',  
    'yourname'  => 'Ваше имя', 
    'youremail'  => 'Ваша Эл. Почта',
	'yourphone'  => 'Ваша Телефон',
    'copyright'  => 'Все права защищены', 
    'faq'  => 'Часто задаваемые вопросы',
	'ask'  => 'Задайте нам вопрос', 
    'video'  => 'видео',
		////////////// EMAIL
	'valid_name'  => 'Такое название не существует ',   
	'valid_send'  => 'Такое сообщение не может быть отправлено ',
	'valid_error'  => 'ошибка  ',
	'goback'  => 'Вернуться к началу',
	'yourname'  => 'Ваше имя',  		
	'youremail' => 'Ваша Эл. Почта',  
	'yourmessage' => 'Ваше сообщение',
	 
	'success' => 'Эл. почта успешно отправлено ',
	////REALESTATE
	'cars' => 'автомобильный',
	'reklama' => 'реклама',
	'vip' => 'VIP Объявления',
	'floora' => 'этаж',
	'rea' => 'Недвижимость',
	'mypage' => 'Моя страница',
	'addnew' => 'Добавить',
	'edit' => 'Изменить',
	'all' => 'все',
	'selectcity' => 'Выберите город',
	'districts' => 'Выберите район',
	'title' => 'заголовок',
	'categories' => 'категория',
	'situation' => 'состояние',
	'need' => 'тип операции',
	'livingsize' => 'Жилая площадь',
	'lotsize' => 'Площадь участка',
	'floors' => 'Сколько этажей здания?',
	'floor' => 'на каком этаже находится объект?',
	'rooms' => 'Число комнат',
	'batha' => 'Мокрая точка',
	'bath' => 'Число Мокрых точек',
	'heating' => 'отопление',
	'cooling' => 'кондиционер',
	'gaz' => 'газ',
	'parking' => 'парковка',
	'price' => 'цена',
	'mainphoto' => 'Главная Фото',
	'otherphotos' => 'Другие изображения (максимум 9 штук)',
	'date' => 'дата',
	/*'keywords' => 'საკვანძო სიტყვები',*/
	'keywords' => 'телефон',
	'description' => 'описание',
	'submit' => 'Сохранить',
	 
	'delete' => 'Удалить',	
	'noresult' => 'Нет данных ',
	'areyousure' => 'Вы уверены, что хотите удалить?',
	'countfilesmore' => 'Загруженные файлы более девяти ',
	'is_need_id' => 'Поле тип транзакции пуст ',
	'is_category_id' => 'Поле отображения Категория ',
	'is_city_id' => 'Город поле пусто ',
	'is_district_id' => 'Район поле пусто ',
	'is_situation_id' => ' Состояние поля пусто ',
	'is_title' => 'В теме поле пусто ',
	'is_price' => 'Поле Значение пусто ',
	'morehouse' => 'У вас нет прав для добавления более 9 объектов ',
	
	 
	
	//// SEARCH
	'price_from' => 'Цена от',
	'price_to' => 'Цена до',
	'rooms_from' => 'Комнат от',
	'rooms_to' => 'Комнат до',
	'notfaond' => 'Нет объектов',
	'forsearch' => 'в результате',
	
	
	'buildhous' => 'Стоимость строительства', 
	'dimensions' => 'Габариты дома',
	'proprice' => 'Cтоимость проекта',
	'sm' => 'М<sup>2</sup>',	
	'co' => 'у.е.',
	'latestProjects' => 'Последние проекты', 
	'preparationtime' => 'Срок подготовки проекта',
	'fromto' => 'от 7 до 25 дней', 
	'fromsm' => 'от м2',
	'tosm' => 'до м2',
	
	'garage' => 'Гараж',
	'with_garage' => 'с Гаражом',
	'without_garage' => 'без Гаража',
	
	);

	

	$str = $langua[$str];

	

	if(in_array($str,$langua)) return $str;

	else return false;

	

	

	} 



 ?>